tutorials/cssInterFoam/test-capillary-wave/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             interFoam;

startTime               lastTime;

stopAt                  endTime;

endTime                 6e-5;

deltaT                  2e-9;

writeControl            adjustableRunTime;

writeInterval           5e-7;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        uncompressed;

timeFormat              scientific;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   0.5;
maxAlphaCo              0.5;

maxDeltaT               5e-6;


// ************************************************************************* //
