tutorials/cssInterFoam/test-capillary-wave/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottom
    {
        type            patch;
        nFaces          300;
        startFace       179400;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       179700;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       180000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    top
    {
        type            patch;
        nFaces          300;
        startFace       180300;
    }
    backFront
    {
        type            empty;
        inGroups        1(empty);
        nFaces          180000;
        startFace       180600;
    }
)

// ************************************************************************* //
